IDEA Open Model
ConnectionData Class
 Provides data of the connection
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class ConnectionData
Public Class ConnectionData
public ref class ConnectionData
The ConnectionData type exposes the following members.
Constructors
Name | Description
ConnectionData
Initializes a new instance of the ConnectionData class
Top
Properties
Name | Description
Beams
 Connected beams
BoltGrids
 Bolt grids which belongs to the connection
ConcreteBlocks
 ConcreteBlocksof the connection
Plates
 Plates of the connection
Welds
 Welds of the connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace